pengelola lamaran kerja + revisi kampus/cvbara/app/Controllers/Pelamar.php

    public function index(){
        $model = new pelamarModel();
        $kunci = $this->request->getPost('cari');
        $dipisi = $this->request->getPost('divisi');

        if ($kunci!="") {
            $query = $model->pencarian($kunci);
            $hasil = "Pencarian dengan nama <B>$kunci</B> ditemukan ".$query->affectedRows()." Data";
        } else if ($dipisi!="") {
            $query = $model->nyari($dipisi);
            $hasil = "Pencarian dengan divisi <B>$dipisi</B> ditemukan ".$query->affectedRows()." Data";
        } else {
            $query = $model;
            $hasil = "";
        }

        $data['pelamar'] = $model->where('status',  'Belum Interview')->where('jenis',  'Karyawan')->paginate(5);
        $data['magang'] = $model->where('status',  'Belum Interview')->where('jenis',  'Magang')->paginate(5);
---
SELECT *
FROM `pelamar`
WHERE `status` = 'Belum Interview'
AND `jenis` = 'Karyawan'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `pelamar`
WHERE `status` = 'Belum Interview'
AND `jenis` = 'Karyawan'
SELECT *
FROM `pelamar`
WHERE `status` = 'Belum Interview'
AND `jenis` = 'Magang'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `pelamar`
WHERE `status` = 'Belum Interview'
AND `jenis` = 'Magang'

    public function kirimemail(){
        //$model = new pelamarModel();
        $id = $this->request->getVar('id');
        $status = [
            'status' => 'Sedang Interview',
        ];
        $model->update($id, $status);
        $user = $request->getVar('nama');
        $model = new pelamarModel();
        $modell = new logModel();
        $imel = $model->select('email')->where('id_pelamar', $id)->first();
        $nama = $model->select('nama')->where('id_pelamar', $id)->first();
---
SELECT `email`
FROM `pelamar`
WHERE `id_pelamar` = '519070154'
 LIMIT 1
SELECT `nama`
FROM `pelamar`
WHERE `id_pelamar` = '519070154'
 LIMIT 1

    public function interview(){
        $model = new pelamarModel();

        $kunci = $this->request->getPost('cari');
        $dipisi = $this->request->getPost('divisi');

        if ($kunci!="") {
            $query = $model->pencarian($kunci);
            $hasil = "Pencarian dengan nama <B>$kunci</B> ditemukan ".$query->affectedRows()." Data";
        } else if ($dipisi!="") {
            $query = $model->nyari($dipisi);
            $hasil = "Pencarian dengan divisi <B>$dipisi</B> ditemukan ".$query->affectedRows()." Data";
        } else {
            $query = $model;
            $hasil = "";
        }
        $data['pelamar'] = $model->where('status',  'Sedang Interview')->paginate(5);
---
SELECT *
FROM `pelamar`
WHERE `status` = 'Sedang Interview'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `pelamar`
WHERE `status` = 'Sedang Interview'

    public function acc(){
        $db = \Config\Database::connect();
        $request = \Config\Services::request();
        $id = $request->getVar('id');
        $user = $request->getVar('nama');
        $model = new pelamarModel();
        $modell = new logModel();
        $imel = $model->select('email')->where('id_pelamar', $id)->first();
        $nama = $model->select('nama')->where('id_pelamar', $id)->first();
        //var_dump($user);die();
        //$session = session();
        $message = "Lorem ipsum dolor sit amet consectetur adipisicing elit. Impedit odit nesciunt magni hic eveniet ex voluptatum accusamus eum temporibus illum! Explicabo quis odio nobis nam, ea mollitia reiciendis excepturi quaerat!";
        $email = \Config\Services::email();
        $email->setFrom('admin@bara.co.id', 'Admin Bara');
        $email->setTo($imel);
        $email->setSubject('Panggilan Interview');
        $email->setMessage($message);
        $email->send();
        $email->printDebugger(['headers']);
        $model->update($id, [
            'status'            => "Diterima"
        ]);
        $session = session();
        $data = [
            'id'            =>  '',
            'id_users'      =>  $id,
            'keterangan'    =>  "Pelamar dengan nama ".$nama['nama']." diterima oleh ".$user,
            'tanggal'       => date('d-m-Y'),
        ];
        $modell->insert($data);
---
SELECT `email`
FROM `pelamar`
WHERE `id_pelamar` = '519070154'
 LIMIT 1
SELECT `nama`
FROM `pelamar`
WHERE `id_pelamar` = '519070154'
 LIMIT 1
UPDATE `pelamar` SET `status` = 'Diterima'
WHERE `pelamar`.`id_pelamar` IN ('519070154')
INSERT INTO `log` (`id`, `id_users`, `keterangan`, `tanggal`) VALUES ('', '519070154', 'Pelamar dengan nama Martin diterima oleh Admin Bara', '27-12-2022')

    public function diterima(){
        $model = new pelamarModel();
        $pager = \Config\Services::pager();
        $kunci = $this->request->getPost('cari');
        $dipisi = $this->request->getPost('divisi');

        if ($kunci!="") {
            $query = $model->pencarian($kunci);
            $hasil = "Pencarian dengan nama <B>$kunci</B> ditemukan ".$query->affectedRows()." Data";
        } else if ($dipisi!="") {
            $query = $model->nyari($dipisi);
            $hasil = "Pencarian dengan divisi <B>$dipisi</B> ditemukan ".$query->affectedRows()." Data";
        } else {
            $query = $model;
            $hasil = "";
        }

        $data['pelamar'] = $model->where('status',  'Diterima')->paginate(5);
---
SELECT *
FROM `pelamar`
WHERE `status` = 'Diterima'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `pelamar`
WHERE `status` = 'Diterima'