pengelola lamaran kerja + revisi kampus/cvbara/app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `username` = 'adminbara'
 LIMIT 1
---
    public function login(){
        $session = session();
        $model = new UsersModel();
        $user = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $pw = openssl_encrypt($password, "aes-256-cbc", "https://bara.co.id/", 0, md5("RaihanMP","GumelarGR"));
        $data = $model->where('username', $user)->first();