pengelola lamaran kerja/cvbara/app/Controllers/Home.php

    public function index()
    {
        $model = new LowonganModel();
        $data['lowongan'] = $model->paginate(5);
---
SELECT *
FROM `lowongan`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `lowongan`