pengelola lamaran kerja/cvbara/app/Controllers/Pelamar.php

    public function index(){
        $model = new pelamarModel();
        $kunci = $this->request->getPost('cari');
        $dipisi = $this->request->getPost('divisi');

        if ($kunci!="") {
            $query = $model->pencarian($kunci);
            $hasil = "Pencarian dengan nama <B>$kunci</B> ditemukan ".$query->affectedRows()." Data";
        } else if ($dipisi!="") {
            $query = $model->nyari($dipisi);
            $hasil = "Pencarian dengan divisi <B>$dipisi</B> ditemukan ".$query->affectedRows()." Data";
        } else {
            $query = $model;
            $hasil = "";
        }

        $data['pelamar'] = $model->where('status',  'Belum Interview')->paginate(5);
---
SELECT *
FROM `pelamar`
WHERE `status` = 'Belum Interview'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `pelamar`
WHERE `status` = 'Belum Interview'

    public function lamar()
    {
        $difisi = new DivisiModel();
        $model = new pelamarModel();
        $modell = new CVModel();
        $modelll = new PortoModel();
             $divisi = $difisi->select('id_divisi')->where('Nama',$this->request->getPost('divisi'))->first();
             $file = $this->request->getFile('cv');
             $fileName = $file->getName();
             $belum = "Belum Interview";
             $baru = rand();
             $data = array(
                //  'no'                => "",
                 'id_pelamar'        => $baru,
                 'nama'              => $this->request->getPost('nama'),
                 'email'             => $this->request->getPost('email'),
                 'deskripsi'         => $this->request->getPost('desk'),
                 'id_divisi'         => $divisi,
                 'cv'                => $fileName,
                 'jenis'             => $this->request->getPost('jenis'),
                 'status'            => $belum,
             );
             $model->insert($data);
---
SELECT `id_divisi`
FROM `divisi`
WHERE `Nama` = 'Mobile Apps Developer'
 LIMIT 1
INSERT INTO `pelamar` (`id_pelamar`, `nama`, `email`, `deskripsi`, `id_divisi`, `cv`, `jenis`, `status`) VALUES (1571078261, 'kemem', 'kemem@pink.com', 'fgh', ('DIV02'), 'surat pengantar kp.pdf', 'Karyawan', 'Belum Interview')

                'id_pelamar'      => $baru,
                'porto'           => $this->request->getPost('porto'),
            );
             $done = $modelll->insert($dataporto);
---
INSERT INTO `porto` (`no`, `id_pelamar`, `porto`) VALUES ('', 1571078261, 'asdeea')

    public function kirimemail(){
        $model = new pelamarModel();
        $id = $this->request->getVar('id');
        $status = [
            'status' => 'Sedang Interview',
        ];
        $model->update($id, $status);
        $nama = $model->select('nama')->where('id_pelamar', $id)->first();
        $imel = $model->select('email')->where('id_pelamar', $id)->first();
---
UPDATE `pelamar` SET `status` = 'Sedang Interview'
WHERE `pelamar`.`id_pelamar` IN ('502844138')
SELECT `nama`
FROM `pelamar`
WHERE `id_pelamar` = '502844138'
 LIMIT 1
SELECT `email`
FROM `pelamar`
WHERE `id_pelamar` = '502844138'
 LIMIT 1

    public function interview(){
        $model = new pelamarModel();

        $kunci = $this->request->getPost('cari');
        $dipisi = $this->request->getPost('divisi');

        if ($kunci!="") {
            $query = $model->pencarian($kunci);
            $hasil = "Pencarian dengan nama <B>$kunci</B> ditemukan ".$query->affectedRows()." Data";
        } else if ($dipisi!="") {
            $query = $model->nyari($dipisi);
            $hasil = "Pencarian dengan divisi <B>$dipisi</B> ditemukan ".$query->affectedRows()." Data";
        } else {
            $query = $model;
            $hasil = "";
        }
        $data['pelamar'] = $model->where('status',  'Sedang Interview')->paginate(5);
---
SELECT *
FROM `pelamar`
WHERE `status` = 'Sedang Interview'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `pelamar`
WHERE `status` = 'Sedang Interview'

    public function acc(){
        $db = \Config\Database::connect();
        $request = \Config\Services::request();
        $id = $request->getVar('id');
        $model = new pelamarModel();
        $imel = $model->select('email')->where('id_pelamar', $id)->first();
        //var_dump($nama);die();
        //$session = session();
        $message = "Lorem ipsum dolor sit amet consectetur adipisicing elit. Impedit odit nesciunt magni hic eveniet ex voluptatum accusamus eum temporibus illum! Explicabo quis odio nobis nam, ea mollitia reiciendis excepturi quaerat!";
        $email = \Config\Services::email();
        $email->setFrom('admin@bara.co.id', 'Admin Bara');
        $email->setTo($imel);
        $email->setSubject('Panggilan Interview');
        $email->setMessage($message);
        $email->send();
        $email->printDebugger(['headers']);
        $model->update($id, [
            'status'            => "Diterima"
        ]);
---
SELECT `email`
FROM `pelamar`
WHERE `id_pelamar` = '779120913'
 LIMIT 1
UPDATE `pelamar` SET `status` = 'Diterima'
WHERE `pelamar`.`id_pelamar` IN ('779120913')

    public function diterima(){
        $model = new pelamarModel();
        $pager = \Config\Services::pager();
        $kunci = $this->request->getPost('cari');
        $dipisi = $this->request->getPost('divisi');

        if ($kunci!="") {
            $query = $model->pencarian($kunci);
            $hasil = "Pencarian dengan nama <B>$kunci</B> ditemukan ".$query->affectedRows()." Data";
        } else if ($dipisi!="") {
            $query = $model->nyari($dipisi);
            $hasil = "Pencarian dengan divisi <B>$dipisi</B> ditemukan ".$query->affectedRows()." Data";
        } else {
            $query = $model;
            $hasil = "";
        }

        $data['pelamar'] = $model->where('status',  'Diterima')->paginate(5);
---
SELECT *
FROM `pelamar`
WHERE `status` = 'Diterima'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `pelamar`
WHERE `status` = 'Diterima'

    public function ditolak(){
        $model = new pelamarModel();
        $pager = \Config\Services::pager();
        $kunci = $this->request->getPost('cari');
        $dipisi = $this->request->getPost('divisi');

        if ($kunci!="") {
            $query = $model->pencarian($kunci);
            $hasil = "Pencarian dengan nama <B>$kunci</B> ditemukan ".$query->affectedRows()." Data";
        } else if ($dipisi!="") {
            $query = $model->nyari($dipisi);
            $hasil = "Pencarian dengan divisi <B>$dipisi</B> ditemukan ".$query->affectedRows()." Data";
        } else {
            $query = $model;
            $hasil = "";
        }

        $data['pelamar'] = $model->where('status',  'Ditolak')->paginate(5);
---
SELECT *
FROM `pelamar`
WHERE `status` = 'Ditolak'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `pelamar`
WHERE `status` = 'Ditolak'