pengelola lamaran kerja + revisi kampus/cvbara/app/Views/admin/pages/interview.php

SELECT *
FROM `divisi`
---
                                        <option>Pilih Divisi</option>
                                            <?php
                                                $data = $db->table('divisi');
                                                $nama = $data->get();

SELECT *
FROM `divisi`
---
                                        <option>Pilih Divisi</option>
                                            <?php
                                                $data = $db->table('divisi');
                                                $nama = $data->get();