pengelola lamaran kerja + revisi kampus/cvbara/app/Views/index.php

SELECT COUNT(*) AS `numrows`
FROM `divisi`
---
    $results = $db->table('lowongan');
    $builder = $db->table('divisi');
    $pel     = $db->table('pelamar');
    $jumlah  = $builder->countAllResults();