pengelola lamaran kerja/cvbara/app/Views/admin/pages/ditolak.php

SELECT *
FROM `divisi`
---
                                        <option>Pilih Divisi</option>
                                            <?php
                                                $data = $db->table('divisi');
                                                $nama = $data->get();