pengelola lamaran kerja/cvbara/app/Views/admin/pages/index.php

                                        <option>Pilih Divisi</option>
                                            <?php
                                                $data = $db->table('divisi');
                                                $nama = $data->get();
---
SELECT *
FROM `divisi`