invoice/bara/app/Controllers/Ingpois.php

SELECT `id_tagihan`
FROM `tagihan`
WHERE `no_invoice` = '004/BE-INV/22-XI/2022'
 LIMIT 1
---
    public function index()
    {
        $db = \Config\Database::connect();
        $pager = \Config\Services::pager();
        $detail = new detailtagihan();
        $tag = new tagihan();
        $idtag = $tag->select('id_tagihan')->where('no_invoice', $this->request->getVar('noinv'))->first();